<!doctype html>

<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br><span class="line">117</span><br><span class="line">118</span><br><span class="line">119</span><br><span class="line">120</span><br><span class="line">121</span><br><span class="line">122</span><br><span class="line">123</span><br><span class="line">124</span><br><span class="line">125</span><br><span class="line">126</span><br><span class="line">127</span><br><span class="line">128</span><br><span class="line">129</span><br><span class="line">130</span><br><span class="line">131</span><br><span class="line">132</span><br><span class="line">133</span><br><span class="line">134</span><br><span class="line">135</span><br><span class="line">136</span><br><span class="line">137</span><br><span class="line">138</span><br><span class="line">139</span><br><span class="line">140</span><br><span class="line">141</span><br><span class="line">142</span><br><span class="line">143</span><br><span class="line">144</span><br><span class="line">145</span><br><span class="line">146</span><br><span class="line">147</span><br><span class="line">148</span><br><span class="line">149</span><br><span class="line">150</span><br><span class="line">151</span><br><span class="line">152</span><br><span class="line">153</span><br><span class="line">154</span><br><span class="line">155</span><br><span class="line">156</span><br><span class="line">157</span><br><span class="line">158</span><br><span class="line">159</span><br><span class="line">160</span><br><span class="line">161</span><br><span class="line">162</span><br><span class="line">163</span><br><span class="line">164</span><br><span class="line">165</span><br><span class="line">166</span><br><span class="line">167</span><br><span class="line">168</span><br><span class="line">169</span><br><span class="line">170</span><br><span class="line">171</span><br><span class="line">172</span><br><span class="line">173</span><br><span class="line">174</span><br><span class="line">175</span><br><span class="line">176</span><br><span class="line">177</span><br><span class="line">178</span><br><span class="line">179</span><br><span class="line">180</span><br><span class="line">181</span><br><span class="line">182</span><br><span class="line">183</span><br><span class="line">184</span><br><span class="line">185</span><br><span class="line">186</span><br><span class="line">187</span><br><span class="line">188</span><br><span class="line">189</span><br><span class="line">190</span><br><span class="line">191</span><br><span class="line">192</span><br><span class="line">193</span><br><span class="line">194</span><br></pre></td><td class="code"><pre><span class="line">$ pahole pointer_adjustment</span><br><span class="line">die__process_class: tag not supported 0x2f (template_type_parameter)!</span><br><span class="line">struct typedef __va_list_tag __va_list_tag &#123;</span><br><span class="line">        unsigned int               gp_offset;            /*     0     4 */</span><br><span class="line">        unsigned int               fp_offset;            /*     4     4 */</span><br><span class="line">        void *                     overflow_arg_area;    /*     8     8 */</span><br><span class="line">        void *                     reg_save_area;        /*    16     8 */</span><br><span class="line"></span><br><span class="line">        /* size: 24, cachelines: 1, members: 4 */</span><br><span class="line">        /* last cacheline: 24 bytes */</span><br><span class="line">&#125;;</span><br><span class="line">struct _IO_FILE &#123;</span><br><span class="line">        int                        _flags;               /*     0     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        char *                     _IO_read_ptr;         /*     8     8 */</span><br><span class="line">        char *                     _IO_read_end;         /*    16     8 */</span><br><span class="line">        char *                     _IO_read_base;        /*    24     8 */</span><br><span class="line">        char *                     _IO_write_base;       /*    32     8 */</span><br><span class="line">        char *                     _IO_write_ptr;        /*    40     8 */</span><br><span class="line">        char *                     _IO_write_end;        /*    48     8 */</span><br><span class="line">        char *                     _IO_buf_base;         /*    56     8 */</span><br><span class="line">        /* --- cacheline 1 boundary (64 bytes) --- */</span><br><span class="line">        char *                     _IO_buf_end;          /*    64     8 */</span><br><span class="line">        char *                     _IO_save_base;        /*    72     8 */</span><br><span class="line">        char *                     _IO_backup_base;      /*    80     8 */</span><br><span class="line">        char *                     _IO_save_end;         /*    88     8 */</span><br><span class="line">        struct _IO_marker *        _markers;             /*    96     8 */</span><br><span class="line">        struct _IO_FILE *          _chain;               /*   104     8 */</span><br><span class="line">        int                        _fileno;              /*   112     4 */</span><br><span class="line">        int                        _flags2;              /*   116     4 */</span><br><span class="line">        __off_t                    _old_offset;          /*   120     8 */</span><br><span class="line">        /* --- cacheline 2 boundary (128 bytes) --- */</span><br><span class="line">        short unsigned int         _cur_column;          /*   128     2 */</span><br><span class="line">        signed char                _vtable_offset;       /*   130     1 */</span><br><span class="line">        char                       _shortbuf[1];         /*   131     1 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        _IO_lock_t *               _lock;                /*   136     8 */</span><br><span class="line">        __off64_t                  _offset;              /*   144     8 */</span><br><span class="line">        struct _IO_codecvt *       _codecvt;             /*   152     8 */</span><br><span class="line">        struct _IO_wide_data *     _wide_data;           /*   160     8 */</span><br><span class="line">        struct _IO_FILE *          _freeres_list;        /*   168     8 */</span><br><span class="line">        void *                     _freeres_buf;         /*   176     8 */</span><br><span class="line">        size_t                     __pad5;               /*   184     8 */</span><br><span class="line">        /* --- cacheline 3 boundary (192 bytes) --- */</span><br><span class="line">        int                        _mode;                /*   192     4 */</span><br><span class="line">        char                       _unused2[20];         /*   196    20 */</span><br><span class="line"></span><br><span class="line">        /* size: 216, cachelines: 4, members: 29 */</span><br><span class="line">        /* <span class="built_in">sum</span> members: 208, holes: 2, <span class="built_in">sum</span> holes: 8 */</span><br><span class="line">        /* last cacheline: 24 bytes */</span><br><span class="line">&#125;;</span><br><span class="line">struct tm &#123;</span><br><span class="line">        int                        tm_sec;               /*     0     4 */</span><br><span class="line">        int                        tm_min;               /*     4     4 */</span><br><span class="line">        int                        tm_hour;              /*     8     4 */</span><br><span class="line">        int                        tm_mday;              /*    12     4 */</span><br><span class="line">        int                        tm_mon;               /*    16     4 */</span><br><span class="line">        int                        tm_year;              /*    20     4 */</span><br><span class="line">        int                        tm_wday;              /*    24     4 */</span><br><span class="line">        int                        tm_yday;              /*    28     4 */</span><br><span class="line">        int                        tm_isdst;             /*    32     4 */</span><br><span class="line"></span><br><span class="line">        /* XXX 4 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">        long int                   tm_gmtoff;            /*    40     8 */</span><br><span class="line">        const char  *              tm_zone;              /*    48     8 */</span><br><span class="line"></span><br><span class="line">        /* size: 56, cachelines: 1, members: 11 */</span><br><span class="line">        /* <span class="built_in">sum</span> members: 52, holes: 1, <span class="built_in">sum</span> holes: 4 */</span><br><span class="line">        /* last cacheline: 56 bytes */</span><br><span class="line">&#125;;</span><br><span class="line">struct lconv &#123;</span><br><span class="line">        char *                     decimal_point;        /*     0     8 */</span><br><span class="line">        char *                     thousands_sep;        /*     8     8 */</span><br><span class="line">        char *                     grouping;             /*    16     8 */</span><br><span class="line">        char *                     int_curr_symbol;      /*    24     8 */</span><br><span class="line">        char *                     currency_symbol;      /*    32     8 */</span><br><span class="line">        char *                     mon_decimal_point;    /*    40     8 */</span><br><span class="line">        char *                     mon_thousands_sep;    /*    48     8 */</span><br><span class="line">        char *                     mon_grouping;         /*    56     8 */</span><br><span class="line">        /* --- cacheline 1 boundary (64 bytes) --- */</span><br><span class="line">        char *                     positive_sign;        /*    64     8 */</span><br><span class="line">        char *                     negative_sign;        /*    72     8 */</span><br><span class="line">        char                       int_frac_digits;      /*    80     1 */</span><br><span class="line">        char                       frac_digits;          /*    81     1 */</span><br><span class="line">        char                       p_cs_precedes;        /*    82     1 */</span><br><span class="line">        char                       p_sep_by_space;       /*    83     1 */</span><br><span class="line">        char                       n_cs_precedes;        /*    84     1 */</span><br><span class="line">        char                       n_sep_by_space;       /*    85     1 */</span><br><span class="line">        char                       p_sign_posn;          /*    86     1 */</span><br><span class="line">        char                       n_sign_posn;          /*    87     1 */</span><br><span class="line">        char                       int_p_cs_precedes;    /*    88     1 */</span><br><span class="line">        char                       int_p_sep_by_space;   /*    89     1 */</span><br><span class="line">        char                       int_n_cs_precedes;    /*    90     1 */</span><br><span class="line">        char                       int_n_sep_by_space;   /*    91     1 */</span><br><span class="line">        char                       int_p_sign_posn;      /*    92     1 */</span><br><span class="line">        char                       int_n_sign_posn;      /*    93     1 */</span><br><span class="line"></span><br><span class="line">        /* size: 96, cachelines: 2, members: 24 */</span><br><span class="line">        /* padding: 2 */</span><br><span class="line">        /* last cacheline: 32 bytes */</span><br><span class="line">&#125;;</span><br><span class="line">struct _G_fpos_t &#123;</span><br><span class="line">        __off_t                    __pos;                /*     0     8 */</span><br><span class="line">        __mbstate_t                __state;              /*     8     8 */</span><br><span class="line"></span><br><span class="line">        /* size: 16, cachelines: 1, members: 2 */</span><br><span class="line">        /* last cacheline: 16 bytes */</span><br><span class="line">&#125;;</span><br><span class="line">class Derived : public Base1, public Base2 &#123;</span><br><span class="line">public:</span><br><span class="line"></span><br><span class="line">        /* class Base1               &lt;ancestor&gt;; */      /*     0    24 */</span><br><span class="line"></span><br><span class="line">        /* XXX last struct has 7 bytes of padding */</span><br><span class="line"></span><br><span class="line">        /* class Base2               &lt;ancestor&gt;; */      /*    24    16 */</span><br><span class="line"></span><br><span class="line">        /* XXX last struct has 4 bytes of padding */</span><br><span class="line">        /* XXX 65532 bytes hole, try to pack */</span><br><span class="line">        void ~Derived(class Derived *, int);</span><br><span class="line"></span><br><span class="line">        void Derived(class Derived *, );</span><br><span class="line"></span><br><span class="line">        void Derived(class Derived *, const class Derived  &amp;);</span><br><span class="line"></span><br><span class="line">        void Derived(class Derived *);</span><br><span class="line"></span><br><span class="line">        virtual void foo(class Derived *);</span><br><span class="line"></span><br><span class="line">        virtual void bar(class Derived *);</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">        int                        m_v1;                 /*    36     4 */</span><br><span class="line">        /* vtable has 2 entries: &#123;</span><br><span class="line">           [0] = foo((null)), </span><br><span class="line">           [1] = bar((null)), </span><br><span class="line">        &#125; */</span><br><span class="line">        /* size: 40, cachelines: 1, members: 3 */</span><br><span class="line">        /* <span class="built_in">sum</span> members: 4, holes: 1, <span class="built_in">sum</span> holes: 65532 */</span><br><span class="line">        /* paddings: 2, <span class="built_in">sum</span> paddings: 11 */</span><br><span class="line">        /* last cacheline: 40 bytes */</span><br><span class="line"></span><br><span class="line">        /* BRAIN FART ALERT! 40 bytes != 4 (member bytes) + 0 (member bits) + 65532 (byte holes) + 0 (bit holes), diff = -523968 bits */</span><br><span class="line">&#125;;</span><br><span class="line">class Base1 &#123;</span><br><span class="line">public:</span><br><span class="line"></span><br><span class="line">        void ~Base1(class Base1 *, int);</span><br><span class="line"></span><br><span class="line">        void Base1(class Base1 *, );</span><br><span class="line"></span><br><span class="line">        void Base1(class Base1 *, const class Base1  &amp;);</span><br><span class="line"></span><br><span class="line">        void Base1(class Base1 *);</span><br><span class="line"></span><br><span class="line">        int ()(void) * *           _vptr.Base1;          /*     0     8 */</span><br><span class="line">        virtual void foo(class Base1 *);</span><br><span class="line"></span><br><span class="line">        double                     m_v1;                 /*     8     8 */</span><br><span class="line">        char                       m_v2;                 /*    16     1 */</span><br><span class="line">        /* vtable has 1 entries: &#123;</span><br><span class="line">           [0] = foo((null)), </span><br><span class="line">        &#125; */</span><br><span class="line">        /* size: 24, cachelines: 1, members: 3 */</span><br><span class="line">        /* padding: 7 */</span><br><span class="line">        /* last cacheline: 24 bytes */</span><br><span class="line">&#125;;</span><br><span class="line">class Base2 &#123;</span><br><span class="line">public:</span><br><span class="line"></span><br><span class="line">        void ~Base2(class Base2 *, int);</span><br><span class="line"></span><br><span class="line">        void Base2(class Base2 *, );</span><br><span class="line"></span><br><span class="line">        void Base2(class Base2 *, const class Base2  &amp;);</span><br><span class="line"></span><br><span class="line">        void Base2(class Base2 *);</span><br><span class="line"></span><br><span class="line">        int ()(void) * *           _vptr.Base2;          /*     0     8 */</span><br><span class="line">        virtual void bar(class Base2 *);</span><br><span class="line"></span><br><span class="line">        int                        m_v1;                 /*     8     4 */</span><br><span class="line">        /* vtable has 1 entries: &#123;</span><br><span class="line">           [0] = bar((null)), </span><br><span class="line">        &#125; */</span><br><span class="line">        /* size: 16, cachelines: 1, members: 2 */</span><br><span class="line">        /* padding: 4 */</span><br><span class="line">        /* last cacheline: 16 bytes */</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>


<p>On the stack, the first element of a <code>Base1</code> object is the vtable pointer <code>_vptr.Base1</code> and it takes 8 bytes. The base size of a <code>Base1</code> object is <code>sizeof(Base1::_vptr.Base1) + sizeof(Base1::m_v1) + sizeof(Base1::m_v2) = 8 + 8 + 1 = 17</code> bytes, and it is padded to 24 bytes because of the 8 byte alignment requirement for the class.</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br></pre></td><td class="code"><pre><span class="line">class Base1 &#123;</span><br><span class="line">public:</span><br><span class="line"></span><br><span class="line">        void ~Base1(class Base1 *, int);</span><br><span class="line"></span><br><span class="line">        void Base1(class Base1 *, );</span><br><span class="line"></span><br><span class="line">        void Base1(class Base1 *, const class Base1  &amp;);</span><br><span class="line"></span><br><span class="line">        void Base1(class Base1 *);</span><br><span class="line"></span><br><span class="line">        int ()(void) * *           _vptr.Base1;          /*     0     8 */</span><br><span class="line">        virtual void foo(class Base1 *);</span><br><span class="line"></span><br><span class="line">        double                     m_v1;                 /*     8     8 */</span><br><span class="line">        char                       m_v2;                 /*    16     1 */</span><br><span class="line">        /* vtable has 1 entries: &#123;</span><br><span class="line">           [0] = foo((null)), </span><br><span class="line">        &#125; */</span><br><span class="line">        /* size: 24, cachelines: 1, members: 3 */</span><br><span class="line">        /* padding: 7 */</span><br><span class="line">        /* last cacheline: 24 bytes */</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>



<p>Similarly, the first element of a <code>Base2</code> object is the vtable pointer <code>_vptr.Base2</code> and it takes 8 bytes. The base size of a <code>Base2</code> object is <code>sizeof(Base1::_vptr.Base2) + sizeof(Base1::m_v1) = 8 + 4 = 12</code> bytes, and it is padded to 16 bytes because of the 8 byte alignment requirement for the class.</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br></pre></td><td class="code"><pre><span class="line">class Base2 &#123;</span><br><span class="line">public:</span><br><span class="line"></span><br><span class="line">        void ~Base2(class Base2 *, int);</span><br><span class="line"></span><br><span class="line">        void Base2(class Base2 *, );</span><br><span class="line"></span><br><span class="line">        void Base2(class Base2 *, const class Base2  &amp;);</span><br><span class="line"></span><br><span class="line">        void Base2(class Base2 *);</span><br><span class="line"></span><br><span class="line">        int ()(void) * *           _vptr.Base2;          /*     0     8 */</span><br><span class="line">        virtual void bar(class Base2 *);</span><br><span class="line"></span><br><span class="line">        int                        m_v1;                 /*     8     4 */</span><br><span class="line">        /* vtable has 1 entries: &#123;</span><br><span class="line">           [0] = bar((null)), </span><br><span class="line">        &#125; */</span><br><span class="line">        /* size: 16, cachelines: 1, members: 2 */</span><br><span class="line">        /* padding: 4 */</span><br><span class="line">        /* last cacheline: 16 bytes */</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<p>The memory layout of a <code>Derived</code> object on the stack is the stack content of a <code>Base1</code> object which takes 24 bytes followed by a <code>Base2</code> object which takes 16 bytes followed by the <code>Derived</code> member objects. The base size of a <code>Derived</code> object is supposed to be <code>sizeof(Base1) + sizeof(Base2) + sizeof(Derived::m_v1) = 24 + 16 + 4 = 44</code> bytes and it will be further padded to 48 bytes because of the alignment requirement. However, we could see that the actual size of a <code>Derived</code> object is just 40 bytes. This is actually due to a compiler optimization. Because a <code>Base2</code> object will add 4 bytes for padding, and it happens to fit the <code>Derived::m_v1</code> which is of <code>int</code> type, thus <code>Derived::m_v1</code> is placed to the place where originally the padded bytes are for a <code>Base2</code> object. The <code>pahole</code> analysis result also tells us that the offset of <code>Derived::m_v1</code> is 36 instead of 40.</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line">class Derived : public Base1, public Base2 &#123;</span><br><span class="line">public:</span><br><span class="line"></span><br><span class="line">        /* class Base1               &lt;ancestor&gt;; */      /*     0    24 */</span><br><span class="line"></span><br><span class="line">        /* XXX last struct has 7 bytes of padding */</span><br><span class="line"></span><br><span class="line">        /* class Base2               &lt;ancestor&gt;; */      /*    24    16 */</span><br><span class="line"></span><br><span class="line">        /* XXX last struct has 4 bytes of padding */</span><br><span class="line">        /* XXX 65532 bytes hole, try to pack */</span><br><span class="line">        void ~Derived(class Derived *, int);</span><br><span class="line"></span><br><span class="line">        void Derived(class Derived *, );</span><br><span class="line"></span><br><span class="line">        void Derived(class Derived *, const class Derived  &amp;);</span><br><span class="line"></span><br><span class="line">        void Derived(class Derived *);</span><br><span class="line"></span><br><span class="line">        virtual void foo(class Derived *);</span><br><span class="line"></span><br><span class="line">        virtual void bar(class Derived *);</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">        int                        m_v1;                 /*    36     4 */</span><br><span class="line">        /* vtable has 2 entries: &#123;</span><br><span class="line">           [0] = foo((null)), </span><br><span class="line">           [1] = bar((null)), </span><br><span class="line">        &#125; */</span><br><span class="line">        /* size: 40, cachelines: 1, members: 3 */</span><br><span class="line">        /* sum members: 4, holes: 1, sum holes: 65532 */</span><br><span class="line">        /* paddings: 2, sum paddings: 11 */</span><br><span class="line">        /* last cacheline: 40 bytes */</span><br><span class="line"></span><br><span class="line">        /* BRAIN FART ALERT! 40 bytes != 4 (member bytes) + 0 (member bits) + 65532 (byte holes) + 0 (bit holes), diff = -523968 bits */</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

